MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB406/mcu.h
#define U1WTCL U1WTCL
extern volatile uint16_t U1WTCL __attribute__((__sfr__));
__extension__ typedef struct tagU1WTCLBITS {
  union {
    struct {
      uint16_t WTCL:16;
    };
    struct {
      uint16_t WTC0:1;
      uint16_t WTC1:1;
      uint16_t WTC2:1;
      uint16_t WTC3:1;
      uint16_t WTC4:1;
      uint16_t WTC5:1;
      uint16_t WTC6:1;
      uint16_t WTC7:1;
      uint16_t WTC8:1;
      uint16_t WTC9:1;
      uint16_t WTC10:1;
      uint16_t WTC11:1;
      uint16_t WTC12:1;
      uint16_t WTC13:1;
      uint16_t WTC14:1;
      uint16_t WTC15:1;
    };
  };
} U1WTCLBITS;
extern volatile U1WTCLBITS U1WTCLbits __attribute__((__sfr__));


#define UART2 UART2
extern volatile UART UART2 __attribute__((__sfr__));

#define U2MODE U2MODE
extern volatile uint16_t U2MODE __attribute__((__sfr__));
__extension__ typedef struct tagU2MODEBITS {
  union {
    struct {
      uint16_t STSEL:1;
      uint16_t PDSEL:2;
      uint16_t BRGH:1;
      uint16_t URXINV:1;
      uint16_t ABAUD:1;
      uint16_t LPBACK:1;
      uint16_t WAKE:1;
      uint16_t UEN:2;
      uint16_t :1;
      uint16_t RTSMD:1;
      uint16_t IREN:1;
      uint16_t USIDL:1;
      uint16_t :1;
      uint16_t UARTEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t PDSEL0:1;
      uint16_t PDSEL1:1;
      uint16_t :1;
      uint16_t RXINV:1;
      uint16_t :3;
      uint16_t UEN0:1;
      uint16_t UEN1:1;
    };
  };
} U2MODEBITS;
extern volatile U2MODEBITS U2MODEbits __attribute__((__sfr__));

#define U2STA U2STA
extern volatile uint16_t U2STA __attribute__((__sfr__));
__extension__ typedef struct tagU2STABITS {
  union {
    struct {
      uint16_t URXDA:1;
      uint16_t OERR:1;
      uint16_t FERR:1;
      uint16_t PERR:1;
      uint16_t RIDLE:1;
      uint16_t ADDEN:1;
      uint16_t URXISEL:2;
      uint16_t TRMT:1;
      uint16_t UTXBF:1;
      uint16_t UTXEN:1;
      uint16_t UTXBRK:1;
      uint16_t URXEN:1;
      uint16_t UTXISEL0:1;
      uint16_t UTXINV:1;
      uint16_t UTXISEL1:1;
    };
    struct {
      uint16_t :6;
      uint16_t URXISEL0:1;
      uint16_t URXISEL1:1;
    };
  };
} U2STABITS;
extern volatile U2STABITS U2STAbits __attribute__((__sfr__));

#define U2TXREG U2TXREG
extern volatile uint16_t U2TXREG __attribute__((__sfr__));
typedef struct tagU2TXREGBITS {
  uint16_t :15;
  uint16_t LAST:1;
} U2TXREGBITS;
extern volatile U2TXREGBITS U2TXREGbits __attribute__((__sfr__));

#define U2RXREG U2RXREG
extern volatile uint16_t U2RXREG __attribute__((__sfr__));
#define U2BRG U2BRG
extern volatile uint16_t U2BRG __attribute__((__sfr__));
#define U2ADMD U2ADMD
extern volatile uint16_t U2ADMD __attribute__((__sfr__));
__extension__ typedef struct tagU2ADMDBITS {
  union {
    struct {
      uint16_t ADMADDR:8;
      uint16_t ADMMASK:8;
    };
    struct {
      uint16_t ADMADDR0:1;
      uint16_t ADMADDR1:1;
      uint16_t ADMADDR2:1;
      uint16_t ADMADDR3:1;
      uint16_t ADMADDR4:1;
      uint16_t ADMADDR5:1;
      uint16_t ADMADDR6:1;
      uint16_t ADMADDR7:1;
      uint16_t ADMMASK0:1;
      uint16_t ADMMASK1:1;
      uint16_t ADMMASK2:1;
      uint16_t ADMMASK3:1;
      uint16_t ADMMASK4:1;
      uint16_t ADMMASK5:1;
      uint16_t ADMMASK6:1;
      uint16_t ADMMASK7:1;
    };
  };
} U2ADMDBITS;
extern volatile U2ADMDBITS U2ADMDbits __attribute__((__sfr__));

#define U2SCCON U2SCCON
extern volatile uint16_t U2SCCON __attribute__((__sfr__));
__extension__ typedef struct tagU2SCCONBITS {
  union {
    struct {
      uint16_t SCEN:1;
      uint16_t PTRCL:1;
      uint16_t T0PD:1;
      uint16_t CONV:1;
      uint16_t TXRPT:2;
    };
    struct {
      uint16_t :4;
      uint16_t TXRPT0:1;
      uint16_t TXRPT1:1;
    };
  };
} U2SCCONBITS;
extern volatile U2SCCONBITS U2SCCONbits __attribute__((__sfr__));

#define U2SCINT U2SCINT
extern volatile uint16_t U2SCINT __attribute__((__sfr__));
typedef struct tagU2SCINTBITS {
  uint16_t GTCIE:1;
  uint16_t WTCIE:1;
  uint16_t :2;
  uint16_t TXRPTIE:1;
  uint16_t RXRPTIE:1;
  uint16_t PARIE:1;
  uint16_t :1;
  uint16_t GTCIF:1;
  uint16_t WTCIF:1;
  uint16_t :2;
  uint16_t TXRPTIF:1;
  uint16_t RXRPTIF:1;
} U2SCINTBITS;
extern volatile U2SCINTBITS U2SCINTbits __attribute__((__sfr__));

#define U2GTC U2GTC
extern volatile uint16_t U2GTC __attribute__((__sfr__));
__extension__ typedef struct tagU2GTCBITS {
  union {
    struct {
      uint16_t GTC:9;
    };
    struct {
      uint16_t GTC0:1;
      uint16_t GTC1:1;
      uint16_t GTC2:1;
      uint16_t GTC3:1;
      uint16_t GTC4:1;
      uint16_t GTC5:1;
      uint16_t GTC6:1;
      uint16_t GTC7:1;
      uint16_t GTC8:1;
    };
  };
} U2GTCBITS;
extern volatile U2GTCBITS U2GTCbits __attribute__((__sfr__));

#define U2WTCH U2WTCH
extern volatile uint16_t U2WTCH __attribute__((__sfr__));
__extension__ typedef struct tagU2WTCHBITS {
  union {
    struct {
      uint16_t WTCH:8;
    };
    struct {
      uint16_t WTC16:1;
      uint16_t WTC17:1;
      uint16_t WTC18:1;
      uint16_t WTC19:1;
      uint16_t WTC20:1;
      uint16_t WTC21:1;
      uint16_t WTC22:1;
      uint16_t WTC23:1;
    };
  };
} U2WTCHBITS;
extern volatile U2WTCHBITS U2WTCHbits __attribute__((__sfr__));

#define U2WTCL U2WTCL
extern volatile uint16_t U2WTCL __attribute__((__sfr__));
__extension__ typedef struct tagU2WTCLBITS {
  union {
    struct {
      uint16_t WTCL:16;
    };
    struct {
      uint16_t WTC0:1;
      uint16_t WTC1:1;
      uint16_t WTC2:1;
      uint16_t WTC3:1;
      uint16_t WTC4:1;
      uint16_t WTC5:1;
      uint16_t WTC6:1;
      uint16_t WTC7:1;
      uint16_t WTC8:1;
      uint16_t WTC9:1;
      uint16_t WTC10:1;
      uint16_t WTC11:1;
      uint16_t WTC12:1;
      uint16_t WTC13:1;
      uint16_t WTC14:1;
      uint16_t WTC15:1;
    };
  };
} U2WTCLBITS;
extern volatile U2WTCLBITS U2WTCLbits __attribute__((__sfr__));


#define UART3 UART3
extern volatile UART UART3 __attribute__((__sfr__));

#define U3MODE U3MODE
extern volatile uint16_t U3MODE __attribute__((__sfr__));
__extension__ typedef struct tagU3MODEBITS {
  union {
    struct {
      uint16_t STSEL:1;
      uint16_t PDSEL:2;
      uint16_t BRGH:1;
      uint16_t URXINV:1;
      uint16_t ABAUD:1;
      uint16_t LPBACK:1;
      uint16_t WAKE:1;
      uint16_t UEN:2;
      uint16_t :1;
      uint16_t RTSMD:1;
      uint16_t IREN:1;
      uint16_t USIDL:1;
      uint16_t :1;
      uint16_t UARTEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t PDSEL0:1;
      uint16_t PDSEL1:1;
      uint16_t :1;
      uint16_t RXINV:1;
      uint16_t :3;
      uint16_t UEN0:1;
      uint16_t UEN1:1;
    };
  };
} U3MODEBITS;
