MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB406/mcu.h
#define CRYSTAT CRYSTAT
extern volatile uint16_t CRYSTAT __attribute__((__sfr__));
typedef struct tagCRYSTATBITS {
  uint16_t PGMFAIL:1;
  uint16_t KEYFAIL:1;
  uint16_t MODFAIL:1;
  uint16_t :1;
  uint16_t ROLLOVR:1;
  uint16_t CRYABRT:1;
  uint16_t TXTABSY:1;
  uint16_t CRYBSY:1;
} CRYSTATBITS;
extern volatile CRYSTATBITS CRYSTATbits __attribute__((__sfr__));

#define CRYOTP CRYOTP
extern volatile uint16_t CRYOTP __attribute__((__sfr__));
typedef struct tagCRYOTPBITS {
  uint16_t CRYWR:1;
  uint16_t KEYPG:4;
  uint16_t CRYREAD:1;
  uint16_t OTPIE:1;
  uint16_t PGMTST:1;
  uint16_t KEYPSEL:1;
} CRYOTPBITS;
extern volatile CRYOTPBITS CRYOTPbits __attribute__((__sfr__));

#define CRYKEY CRYKEY
extern volatile uint16_t CRYKEY __attribute__((__sfr__));
#define CRYKEY0 CRYKEY0
extern volatile uint16_t CRYKEY0 __attribute__((__sfr__));
#define CRYKEY1 CRYKEY1
extern volatile uint16_t CRYKEY1 __attribute__((__sfr__));
#define CRYKEY2 CRYKEY2
extern volatile uint16_t CRYKEY2 __attribute__((__sfr__));
#define CRYKEY3 CRYKEY3
extern volatile uint16_t CRYKEY3 __attribute__((__sfr__));
#define CRYKEY4 CRYKEY4
extern volatile uint16_t CRYKEY4 __attribute__((__sfr__));
#define CRYKEY5 CRYKEY5
extern volatile uint16_t CRYKEY5 __attribute__((__sfr__));
#define CRYKEY6 CRYKEY6
extern volatile uint16_t CRYKEY6 __attribute__((__sfr__));
#define CRYKEY7 CRYKEY7
extern volatile uint16_t CRYKEY7 __attribute__((__sfr__));
#define CRYKEY8 CRYKEY8
extern volatile uint16_t CRYKEY8 __attribute__((__sfr__));
#define CRYKEY9 CRYKEY9
extern volatile uint16_t CRYKEY9 __attribute__((__sfr__));
#define CRYKEY10 CRYKEY10
extern volatile uint16_t CRYKEY10 __attribute__((__sfr__));
#define CRYKEY11 CRYKEY11
extern volatile uint16_t CRYKEY11 __attribute__((__sfr__));
#define CRYKEY12 CRYKEY12
extern volatile uint16_t CRYKEY12 __attribute__((__sfr__));
#define CRYKEY13 CRYKEY13
extern volatile uint16_t CRYKEY13 __attribute__((__sfr__));
#define CRYKEY14 CRYKEY14
extern volatile uint16_t CRYKEY14 __attribute__((__sfr__));
#define CRYKEY15 CRYKEY15
extern volatile uint16_t CRYKEY15 __attribute__((__sfr__));
#define CRYTXTA CRYTXTA
extern volatile uint16_t CRYTXTA __attribute__((__sfr__));
#define CRYTXTA0 CRYTXTA0
extern volatile uint16_t CRYTXTA0 __attribute__((__sfr__));
#define CRYTXTA1 CRYTXTA1
extern volatile uint16_t CRYTXTA1 __attribute__((__sfr__));
#define CRYTXTA2 CRYTXTA2
extern volatile uint16_t CRYTXTA2 __attribute__((__sfr__));
#define CRYTXTA3 CRYTXTA3
extern volatile uint16_t CRYTXTA3 __attribute__((__sfr__));
#define CRYTXTA4 CRYTXTA4
extern volatile uint16_t CRYTXTA4 __attribute__((__sfr__));
#define CRYTXTA5 CRYTXTA5
extern volatile uint16_t CRYTXTA5 __attribute__((__sfr__));
#define CRYTXTA6 CRYTXTA6
extern volatile uint16_t CRYTXTA6 __attribute__((__sfr__));
#define CRYTXTA7 CRYTXTA7
extern volatile uint16_t CRYTXTA7 __attribute__((__sfr__));
#define CRYTXTB CRYTXTB
extern volatile uint16_t CRYTXTB __attribute__((__sfr__));
#define CRYTXTB0 CRYTXTB0
extern volatile uint16_t CRYTXTB0 __attribute__((__sfr__));
#define CRYTXTB1 CRYTXTB1
extern volatile uint16_t CRYTXTB1 __attribute__((__sfr__));
#define CRYTXTB2 CRYTXTB2
extern volatile uint16_t CRYTXTB2 __attribute__((__sfr__));
#define CRYTXTB3 CRYTXTB3
extern volatile uint16_t CRYTXTB3 __attribute__((__sfr__));
#define CRYTXTB4 CRYTXTB4
extern volatile uint16_t CRYTXTB4 __attribute__((__sfr__));
#define CRYTXTB5 CRYTXTB5
extern volatile uint16_t CRYTXTB5 __attribute__((__sfr__));
#define CRYTXTB6 CRYTXTB6
extern volatile uint16_t CRYTXTB6 __attribute__((__sfr__));
#define CRYTXTB7 CRYTXTB7
extern volatile uint16_t CRYTXTB7 __attribute__((__sfr__));
#define CRYTXTC CRYTXTC
extern volatile uint16_t CRYTXTC __attribute__((__sfr__));
#define CRYTXTC0 CRYTXTC0
extern volatile uint16_t CRYTXTC0 __attribute__((__sfr__));
#define CRYTXTC1 CRYTXTC1
extern volatile uint16_t CRYTXTC1 __attribute__((__sfr__));
#define CRYTXTC2 CRYTXTC2
extern volatile uint16_t CRYTXTC2 __attribute__((__sfr__));
#define CRYTXTC3 CRYTXTC3
extern volatile uint16_t CRYTXTC3 __attribute__((__sfr__));
#define CRYTXTC4 CRYTXTC4
extern volatile uint16_t CRYTXTC4 __attribute__((__sfr__));
#define CRYTXTC5 CRYTXTC5
extern volatile uint16_t CRYTXTC5 __attribute__((__sfr__));
#define CRYTXTC6 CRYTXTC6
extern volatile uint16_t CRYTXTC6 __attribute__((__sfr__));
#define CRYTXTC7 CRYTXTC7
extern volatile uint16_t CRYTXTC7 __attribute__((__sfr__));
#define U1OTGIR U1OTGIR
extern volatile uint16_t U1OTGIR __attribute__((__sfr__));
typedef struct tagU1OTGIRBITS {
  uint16_t VBUSVDIF:1;
  uint16_t :1;
  uint16_t SESENDIF:1;
  uint16_t SESVDIF:1;
  uint16_t ACTVIF:1;
  uint16_t LSTATEIF:1;
  uint16_t T1MSECIF:1;
  uint16_t IDIF:1;
} U1OTGIRBITS;
extern volatile U1OTGIRBITS U1OTGIRbits __attribute__((__sfr__));

#define U1OTGIE U1OTGIE
extern volatile uint16_t U1OTGIE __attribute__((__sfr__));
typedef struct tagU1OTGIEBITS {
  uint16_t VBUSVDIE:1;
  uint16_t :1;
  uint16_t SESENDIE:1;
  uint16_t SESVDIE:1;
  uint16_t ACTVIE:1;
  uint16_t LSTATEIE:1;
  uint16_t T1MSECIE:1;
  uint16_t IDIE:1;
} U1OTGIEBITS;
extern volatile U1OTGIEBITS U1OTGIEbits __attribute__((__sfr__));

#define U1OTGSTAT U1OTGSTAT
extern volatile uint16_t U1OTGSTAT __attribute__((__sfr__));
typedef struct tagU1OTGSTATBITS {
  uint16_t VBUSVD:1;
  uint16_t :1;
  uint16_t SESEND:1;
  uint16_t SESVD:1;
  uint16_t :1;
  uint16_t LSTATE:1;
  uint16_t :1;
  uint16_t ID:1;
} U1OTGSTATBITS;
extern volatile U1OTGSTATBITS U1OTGSTATbits __attribute__((__sfr__));

#define U1OTGCON U1OTGCON
extern volatile uint16_t U1OTGCON __attribute__((__sfr__));
typedef struct tagU1OTGCONBITS {
  uint16_t VBUSDIS:1;
  uint16_t VBUSCHG:1;
  uint16_t OTGEN:1;
  uint16_t VBUSON:1;
  uint16_t DMPULDWN:1;
  uint16_t DPPULDWN:1;
  uint16_t DMPULUP:1;
  uint16_t DPPULUP:1;
} U1OTGCONBITS;
extern volatile U1OTGCONBITS U1OTGCONbits __attribute__((__sfr__));

#define U1PWRC U1PWRC
extern volatile uint16_t U1PWRC __attribute__((__sfr__));
__extension__ typedef struct tagU1PWRCBITS {
  union {
    struct {
      uint16_t USBPWR:1;
      uint16_t USUSPND:1;
      uint16_t :2;
      uint16_t USLPGRD:1;
      uint16_t :2;
      uint16_t UACTPND:1;
    };
    struct {
      uint16_t :1;
      uint16_t USUSPEND:1;
    };
  };
} U1PWRCBITS;
extern volatile U1PWRCBITS U1PWRCbits __attribute__((__sfr__));

#define U1IR U1IR
extern volatile uint16_t U1IR __attribute__((__sfr__));
__extension__ typedef struct tagU1IRBITS {
  union {
    struct {
      uint16_t URSTIF:1;
      uint16_t UERRIF:1;
      uint16_t SOFIF:1;
      uint16_t TRNIF:1;
      uint16_t IDLEIF:1;
      uint16_t RESUMEIF:1;
      uint16_t ATTACHIF:1;
      uint16_t STALLIF:1;
    };
    struct {
      uint16_t DETACHIF:1;
    };
  };
} U1IRBITS;
extern volatile U1IRBITS U1IRbits __attribute__((__sfr__));

#define U1IE U1IE
extern volatile uint16_t U1IE __attribute__((__sfr__));
__extension__ typedef struct tagU1IEBITS {
  union {
    struct {
      uint16_t URSTIE:1;
      uint16_t UERRIE:1;
      uint16_t SOFIE:1;
      uint16_t TRNIE:1;
      uint16_t IDLEIE:1;
      uint16_t RESUMEIE:1;
      uint16_t ATTACHIE:1;
      uint16_t STALLIE:1;
    };
    struct {
      uint16_t DETACHIE:1;
    };
  };
} U1IEBITS;
