MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB406/mcu.h
extern volatile IOCNEBITS IOCNEbits __attribute__((__sfr__));

#define IOCFE IOCFE
extern volatile uint16_t IOCFE __attribute__((__sfr__));
typedef struct tagIOCFEBITS {
  uint16_t IOCFE0:1;
  uint16_t IOCFE1:1;
  uint16_t IOCFE2:1;
  uint16_t IOCFE3:1;
  uint16_t IOCFE4:1;
  uint16_t IOCFE5:1;
  uint16_t IOCFE6:1;
  uint16_t IOCFE7:1;
} IOCFEBITS;
extern volatile IOCFEBITS IOCFEbits __attribute__((__sfr__));

#define CNPUE CNPUE
extern volatile uint16_t CNPUE __attribute__((__sfr__));
__extension__ typedef struct tagCNPUEBITS {
  union {
    struct {
      uint16_t IOCPE0:1;
      uint16_t IOCPE1:1;
      uint16_t IOCPE2:1;
      uint16_t IOCPE3:1;
      uint16_t IOCPE4:1;
      uint16_t IOCPE5:1;
      uint16_t IOCPE6:1;
      uint16_t IOCPE7:1;
    };
    struct {
      uint16_t IOCPUE0:1;
      uint16_t IOCPUE1:1;
      uint16_t IOCPUE2:1;
      uint16_t IOCPUE3:1;
      uint16_t IOCPUE4:1;
      uint16_t IOCPUE5:1;
      uint16_t IOCPUE6:1;
      uint16_t IOCPUE7:1;
    };
    struct {
      uint16_t CNPUE0:1;
      uint16_t CNPUE1:1;
      uint16_t CNPUE2:1;
      uint16_t CNPUE3:1;
      uint16_t CNPUE4:1;
      uint16_t CNPUE5:1;
      uint16_t CNPUE6:1;
      uint16_t CNPUE7:1;
    };
  };
} CNPUEBITS;
extern volatile CNPUEBITS CNPUEbits __attribute__((__sfr__));

#define IOCPUE IOCPUE
extern volatile uint16_t IOCPUE __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUEBITS {
  union {
    struct {
      uint16_t IOCPE0:1;
      uint16_t IOCPE1:1;
      uint16_t IOCPE2:1;
      uint16_t IOCPE3:1;
      uint16_t IOCPE4:1;
      uint16_t IOCPE5:1;
      uint16_t IOCPE6:1;
      uint16_t IOCPE7:1;
    };
    struct {
      uint16_t IOCPUE0:1;
      uint16_t IOCPUE1:1;
      uint16_t IOCPUE2:1;
      uint16_t IOCPUE3:1;
      uint16_t IOCPUE4:1;
      uint16_t IOCPUE5:1;
      uint16_t IOCPUE6:1;
      uint16_t IOCPUE7:1;
    };
    struct {
      uint16_t CNPUE0:1;
      uint16_t CNPUE1:1;
      uint16_t CNPUE2:1;
      uint16_t CNPUE3:1;
      uint16_t CNPUE4:1;
      uint16_t CNPUE5:1;
      uint16_t CNPUE6:1;
      uint16_t CNPUE7:1;
    };
  };
} IOCPUEBITS;
extern volatile IOCPUEBITS IOCPUEbits __attribute__((__sfr__));

#define CNPDE CNPDE
extern volatile uint16_t CNPDE __attribute__((__sfr__));
__extension__ typedef struct tagCNPDEBITS {
  union {
    struct {
      uint16_t IOCPDE0:1;
      uint16_t IOCPDE1:1;
      uint16_t IOCPDE2:1;
      uint16_t IOCPDE3:1;
      uint16_t IOCPDE4:1;
      uint16_t IOCPDE5:1;
      uint16_t IOCPDE6:1;
      uint16_t IOCPDE7:1;
    };
    struct {
      uint16_t CNPDE0:1;
      uint16_t CNPDE1:1;
      uint16_t CNPDE2:1;
      uint16_t CNPDE3:1;
      uint16_t CNPDE4:1;
      uint16_t CNPDE5:1;
      uint16_t CNPDE6:1;
      uint16_t CNPDE7:1;
    };
  };
} CNPDEBITS;
extern volatile CNPDEBITS CNPDEbits __attribute__((__sfr__));

#define IOCPDE IOCPDE
extern volatile uint16_t IOCPDE __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDEBITS {
  union {
    struct {
      uint16_t IOCPDE0:1;
      uint16_t IOCPDE1:1;
      uint16_t IOCPDE2:1;
      uint16_t IOCPDE3:1;
      uint16_t IOCPDE4:1;
      uint16_t IOCPDE5:1;
      uint16_t IOCPDE6:1;
      uint16_t IOCPDE7:1;
    };
    struct {
      uint16_t CNPDE0:1;
      uint16_t CNPDE1:1;
      uint16_t CNPDE2:1;
      uint16_t CNPDE3:1;
      uint16_t CNPDE4:1;
      uint16_t CNPDE5:1;
      uint16_t CNPDE6:1;
      uint16_t CNPDE7:1;
    };
  };
} IOCPDEBITS;
extern volatile IOCPDEBITS IOCPDEbits __attribute__((__sfr__));

#define TRISF TRISF
extern volatile uint16_t TRISF __attribute__((__sfr__));
typedef struct tagTRISFBITS {
  uint16_t TRISF0:1;
  uint16_t TRISF1:1;
  uint16_t TRISF2:1;
  uint16_t TRISF3:1;
  uint16_t TRISF4:1;
  uint16_t TRISF5:1;
  uint16_t TRISF6:1;
  uint16_t TRISF7:1;
  uint16_t TRISF8:1;
  uint16_t :3;
  uint16_t TRISF12:1;
  uint16_t TRISF13:1;
} TRISFBITS;
extern volatile TRISFBITS TRISFbits __attribute__((__sfr__));

#define PORTF PORTF
extern volatile uint16_t PORTF __attribute__((__sfr__));
typedef struct tagPORTFBITS {
  uint16_t RF0:1;
  uint16_t RF1:1;
  uint16_t RF2:1;
  uint16_t RF3:1;
  uint16_t RF4:1;
  uint16_t RF5:1;
  uint16_t RF6:1;
  uint16_t RF7:1;
  uint16_t RF8:1;
  uint16_t :3;
  uint16_t RF12:1;
  uint16_t RF13:1;
} PORTFBITS;
extern volatile PORTFBITS PORTFbits __attribute__((__sfr__));

#define LATF LATF
extern volatile uint16_t LATF __attribute__((__sfr__));
typedef struct tagLATFBITS {
  uint16_t LATF0:1;
  uint16_t LATF1:1;
  uint16_t LATF2:1;
  uint16_t LATF3:1;
  uint16_t LATF4:1;
  uint16_t LATF5:1;
  uint16_t LATF6:1;
  uint16_t LATF7:1;
  uint16_t LATF8:1;
  uint16_t :3;
  uint16_t LATF12:1;
  uint16_t LATF13:1;
} LATFBITS;
extern volatile LATFBITS LATFbits __attribute__((__sfr__));

#define ODCF ODCF
extern volatile uint16_t ODCF __attribute__((__sfr__));
typedef struct tagODCFBITS {
  uint16_t ODCF0:1;
  uint16_t ODCF1:1;
  uint16_t ODCF2:1;
  uint16_t ODCF3:1;
  uint16_t ODCF4:1;
  uint16_t ODCF5:1;
  uint16_t ODCF6:1;
  uint16_t ODCF7:1;
  uint16_t ODCF8:1;
  uint16_t :3;
  uint16_t ODCF12:1;
  uint16_t ODCF13:1;
} ODCFBITS;
extern volatile ODCFBITS ODCFbits __attribute__((__sfr__));

#define ANSELF ANSELF
extern volatile uint16_t ANSELF __attribute__((__sfr__));
__extension__ typedef struct tagANSELFBITS {
  union {
    struct {
      uint16_t ANSF0:1;
      uint16_t ANSF1:1;
      uint16_t ANSF2:1;
      uint16_t ANSF3:1;
      uint16_t ANSF4:1;
      uint16_t ANSF5:1;
      uint16_t :2;
      uint16_t ANSF8:1;
      uint16_t :3;
      uint16_t ANSF12:1;
      uint16_t ANSF13:1;
    };
    struct {
      uint16_t ANSELF0:1;
      uint16_t ANSELF1:1;
      uint16_t ANSELF2:1;
      uint16_t ANSELF3:1;
      uint16_t ANSELF4:1;
      uint16_t ANSELF5:1;
      uint16_t :2;
      uint16_t ANSELF8:1;
      uint16_t :3;
      uint16_t ANSELF12:1;
      uint16_t ANSELF13:1;
    };
  };
} ANSELFBITS;
extern volatile ANSELFBITS ANSELFbits __attribute__((__sfr__));

#define ANSF ANSF
extern volatile uint16_t ANSF __attribute__((__sfr__));
__extension__ typedef struct tagANSFBITS {
  union {
    struct {
      uint16_t ANSF0:1;
      uint16_t ANSF1:1;
      uint16_t ANSF2:1;
      uint16_t ANSF3:1;
      uint16_t ANSF4:1;
      uint16_t ANSF5:1;
      uint16_t :2;
      uint16_t ANSF8:1;
      uint16_t :3;
      uint16_t ANSF12:1;
      uint16_t ANSF13:1;
    };
    struct {
      uint16_t ANSELF0:1;
      uint16_t ANSELF1:1;
      uint16_t ANSELF2:1;
      uint16_t ANSELF3:1;
      uint16_t ANSELF4:1;
      uint16_t ANSELF5:1;
      uint16_t :2;
      uint16_t ANSELF8:1;
      uint16_t :3;
      uint16_t ANSELF12:1;
      uint16_t ANSELF13:1;
    };
  };
} ANSFBITS;
