MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB406/mcu.h
/* CNPDB */
#define _IOCPDB0 CNPDBbits.IOCPDB0
#define _IOCPDB1 CNPDBbits.IOCPDB1
#define _IOCPDB2 CNPDBbits.IOCPDB2
#define _IOCPDB3 CNPDBbits.IOCPDB3
#define _IOCPDB4 CNPDBbits.IOCPDB4
#define _IOCPDB5 CNPDBbits.IOCPDB5
#define _IOCPDB6 CNPDBbits.IOCPDB6
#define _IOCPDB7 CNPDBbits.IOCPDB7
#define _IOCPDB8 CNPDBbits.IOCPDB8
#define _IOCPDB9 CNPDBbits.IOCPDB9
#define _IOCPDB10 CNPDBbits.IOCPDB10
#define _IOCPDB11 CNPDBbits.IOCPDB11
#define _IOCPDB12 CNPDBbits.IOCPDB12
#define _IOCPDB13 CNPDBbits.IOCPDB13
#define _IOCPDB14 CNPDBbits.IOCPDB14
#define _IOCPDB15 CNPDBbits.IOCPDB15
#define _CNPDB0 CNPDBbits.CNPDB0
#define _CNPDB1 CNPDBbits.CNPDB1
#define _CNPDB2 CNPDBbits.CNPDB2
#define _CNPDB3 CNPDBbits.CNPDB3
#define _CNPDB4 CNPDBbits.CNPDB4
#define _CNPDB5 CNPDBbits.CNPDB5
#define _CNPDB6 CNPDBbits.CNPDB6
#define _CNPDB7 CNPDBbits.CNPDB7
#define _CNPDB8 CNPDBbits.CNPDB8
#define _CNPDB9 CNPDBbits.CNPDB9
#define _CNPDB10 CNPDBbits.CNPDB10
#define _CNPDB11 CNPDBbits.CNPDB11
#define _CNPDB12 CNPDBbits.CNPDB12
#define _CNPDB13 CNPDBbits.CNPDB13
#define _CNPDB14 CNPDBbits.CNPDB14
#define _CNPDB15 CNPDBbits.CNPDB15

/* TRISC */
#define _TRISC12 TRISCbits.TRISC12
#define _TRISC13 TRISCbits.TRISC13
#define _TRISC14 TRISCbits.TRISC14
#define _TRISC15 TRISCbits.TRISC15

/* PORTC */
#define _RC12 PORTCbits.RC12
#define _RC13 PORTCbits.RC13
#define _RC14 PORTCbits.RC14
#define _RC15 PORTCbits.RC15

/* LATC */
#define _LATC12 LATCbits.LATC12
#define _LATC15 LATCbits.LATC15

/* ODCC */
#define _ODCC12 ODCCbits.ODCC12
#define _ODCC15 ODCCbits.ODCC15

/* IOCPC */
/* Bitname _IOCPC12 cannot be defined because it is used by more than one SFR */
#define _IOCPC13 IOCPCbits.IOCPC13
#define _IOCPC14 IOCPCbits.IOCPC14
/* Bitname _IOCPC15 cannot be defined because it is used by more than one SFR */

/* IOCNC */
#define _IOCNC12 IOCNCbits.IOCNC12
#define _IOCNC13 IOCNCbits.IOCNC13
#define _IOCNC14 IOCNCbits.IOCNC14
#define _IOCNC15 IOCNCbits.IOCNC15

/* IOCFC */
#define _IOCFC12 IOCFCbits.IOCFC12
#define _IOCFC13 IOCFCbits.IOCFC13
#define _IOCFC14 IOCFCbits.IOCFC14
#define _IOCFC15 IOCFCbits.IOCFC15

/* CNPUC */
/* Bitname _IOCPC12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC15 cannot be defined because it is used by more than one SFR */
#define _IOCPUC12 CNPUCbits.IOCPUC12
#define _IOCPUC15 CNPUCbits.IOCPUC15
#define _CNPUC12 CNPUCbits.CNPUC12
#define _CNPUC15 CNPUCbits.CNPUC15

/* CNPDC */
#define _IOCPDC12 CNPDCbits.IOCPDC12
#define _IOCPDC15 CNPDCbits.IOCPDC15
#define _CNPDC12 CNPDCbits.CNPDC12
#define _CNPDC15 CNPDCbits.CNPDC15

/* TRISD */
#define _TRISD0 TRISDbits.TRISD0
#define _TRISD1 TRISDbits.TRISD1
#define _TRISD2 TRISDbits.TRISD2
#define _TRISD3 TRISDbits.TRISD3
#define _TRISD4 TRISDbits.TRISD4
#define _TRISD5 TRISDbits.TRISD5
#define _TRISD6 TRISDbits.TRISD6
#define _TRISD7 TRISDbits.TRISD7
#define _TRISD8 TRISDbits.TRISD8
#define _TRISD9 TRISDbits.TRISD9
#define _TRISD10 TRISDbits.TRISD10
#define _TRISD11 TRISDbits.TRISD11

/* PORTD */
#define _RD0 PORTDbits.RD0
#define _RD1 PORTDbits.RD1
#define _RD2 PORTDbits.RD2
#define _RD3 PORTDbits.RD3
#define _RD4 PORTDbits.RD4
#define _RD5 PORTDbits.RD5
#define _RD6 PORTDbits.RD6
#define _RD7 PORTDbits.RD7
#define _RD8 PORTDbits.RD8
#define _RD9 PORTDbits.RD9
#define _RD10 PORTDbits.RD10
#define _RD11 PORTDbits.RD11

/* LATD */
#define _LATD0 LATDbits.LATD0
#define _LATD1 LATDbits.LATD1
#define _LATD2 LATDbits.LATD2
#define _LATD3 LATDbits.LATD3
#define _LATD4 LATDbits.LATD4
#define _LATD5 LATDbits.LATD5
#define _LATD6 LATDbits.LATD6
#define _LATD7 LATDbits.LATD7
#define _LATD8 LATDbits.LATD8
#define _LATD9 LATDbits.LATD9
#define _LATD10 LATDbits.LATD10
#define _LATD11 LATDbits.LATD11

/* ODCD */
#define _ODCD0 ODCDbits.ODCD0
#define _ODCD1 ODCDbits.ODCD1
#define _ODCD2 ODCDbits.ODCD2
#define _ODCD3 ODCDbits.ODCD3
#define _ODCD4 ODCDbits.ODCD4
#define _ODCD5 ODCDbits.ODCD5
#define _ODCD6 ODCDbits.ODCD6
#define _ODCD7 ODCDbits.ODCD7
#define _ODCD8 ODCDbits.ODCD8
#define _ODCD9 ODCDbits.ODCD9
#define _ODCD10 ODCDbits.ODCD10
#define _ODCD11 ODCDbits.ODCD11

/* ANSD */
#define _ANSD0 ANSDbits.ANSD0
#define _ANSD1 ANSDbits.ANSD1
#define _ANSD2 ANSDbits.ANSD2
#define _ANSD3 ANSDbits.ANSD3
#define _ANSD4 ANSDbits.ANSD4
#define _ANSD5 ANSDbits.ANSD5
#define _ANSD6 ANSDbits.ANSD6
#define _ANSD7 ANSDbits.ANSD7
#define _ANSD8 ANSDbits.ANSD8
#define _ANSD9 ANSDbits.ANSD9
#define _ANSD10 ANSDbits.ANSD10
#define _ANSD11 ANSDbits.ANSD11
#define _ANSELD0 ANSDbits.ANSELD0
#define _ANSELD1 ANSDbits.ANSELD1
#define _ANSELD2 ANSDbits.ANSELD2
#define _ANSELD3 ANSDbits.ANSELD3
#define _ANSELD4 ANSDbits.ANSELD4
#define _ANSELD5 ANSDbits.ANSELD5
#define _ANSELD6 ANSDbits.ANSELD6
#define _ANSELD7 ANSDbits.ANSELD7
#define _ANSELD8 ANSDbits.ANSELD8
#define _ANSELD9 ANSDbits.ANSELD9
#define _ANSELD10 ANSDbits.ANSELD10
#define _ANSELD11 ANSDbits.ANSELD11

/* IOCPD */
/* Bitname _IOCPD0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD11 cannot be defined because it is used by more than one SFR */

/* IOCND */
#define _IOCND0 IOCNDbits.IOCND0
#define _IOCND1 IOCNDbits.IOCND1
#define _IOCND2 IOCNDbits.IOCND2
#define _IOCND3 IOCNDbits.IOCND3
#define _IOCND4 IOCNDbits.IOCND4
#define _IOCND5 IOCNDbits.IOCND5
#define _IOCND6 IOCNDbits.IOCND6
#define _IOCND7 IOCNDbits.IOCND7
#define _IOCND8 IOCNDbits.IOCND8
#define _IOCND9 IOCNDbits.IOCND9
#define _IOCND10 IOCNDbits.IOCND10
#define _IOCND11 IOCNDbits.IOCND11

/* IOCFD */
#define _IOCFD0 IOCFDbits.IOCFD0
#define _IOCFD1 IOCFDbits.IOCFD1
#define _IOCFD2 IOCFDbits.IOCFD2
#define _IOCFD3 IOCFDbits.IOCFD3
#define _IOCFD4 IOCFDbits.IOCFD4
#define _IOCFD5 IOCFDbits.IOCFD5
#define _IOCFD6 IOCFDbits.IOCFD6
#define _IOCFD7 IOCFDbits.IOCFD7
#define _IOCFD8 IOCFDbits.IOCFD8
#define _IOCFD9 IOCFDbits.IOCFD9
#define _IOCFD10 IOCFDbits.IOCFD10
#define _IOCFD11 IOCFDbits.IOCFD11

/* CNPUD */
/* Bitname _IOCPD0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD11 cannot be defined because it is used by more than one SFR */
#define _IOCPUD0 CNPUDbits.IOCPUD0
#define _IOCPUD1 CNPUDbits.IOCPUD1
#define _IOCPUD2 CNPUDbits.IOCPUD2
#define _IOCPUD3 CNPUDbits.IOCPUD3
#define _IOCPUD4 CNPUDbits.IOCPUD4
#define _IOCPUD5 CNPUDbits.IOCPUD5
#define _IOCPUD6 CNPUDbits.IOCPUD6
#define _IOCPUD7 CNPUDbits.IOCPUD7
#define _IOCPUD8 CNPUDbits.IOCPUD8
#define _IOCPUD9 CNPUDbits.IOCPUD9
#define _IOCPUD10 CNPUDbits.IOCPUD10
#define _IOCPUD11 CNPUDbits.IOCPUD11
#define _CNPUD0 CNPUDbits.CNPUD0
#define _CNPUD1 CNPUDbits.CNPUD1
#define _CNPUD2 CNPUDbits.CNPUD2
#define _CNPUD3 CNPUDbits.CNPUD3
#define _CNPUD4 CNPUDbits.CNPUD4
#define _CNPUD5 CNPUDbits.CNPUD5
#define _CNPUD6 CNPUDbits.CNPUD6
#define _CNPUD7 CNPUDbits.CNPUD7
#define _CNPUD8 CNPUDbits.CNPUD8
#define _CNPUD9 CNPUDbits.CNPUD9
#define _CNPUD10 CNPUDbits.CNPUD10
#define _CNPUD11 CNPUDbits.CNPUD11

