MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB406/mcu.h
#define _IPC14_SPI4RXIP1_POSITION                0x00000005
#define _IPC14_SPI4RXIP1_MASK                    0x00000020
#define _IPC14_SPI4RXIP1_LENGTH                  0x00000001

#define _IPC14_SPI4RXIP2_POSITION                0x00000006
#define _IPC14_SPI4RXIP2_MASK                    0x00000040
#define _IPC14_SPI4RXIP2_LENGTH                  0x00000001

#define _IPC14_SPI1RXIP0_POSITION                0x00000008
#define _IPC14_SPI1RXIP0_MASK                    0x00000100
#define _IPC14_SPI1RXIP0_LENGTH                  0x00000001

#define _IPC14_SPI1RXIP1_POSITION                0x00000009
#define _IPC14_SPI1RXIP1_MASK                    0x00000200
#define _IPC14_SPI1RXIP1_LENGTH                  0x00000001

#define _IPC14_SPI1RXIP2_POSITION                0x0000000A
#define _IPC14_SPI1RXIP2_MASK                    0x00000400
#define _IPC14_SPI1RXIP2_LENGTH                  0x00000001

#define _IPC14_SPI2RXIP0_POSITION                0x0000000C
#define _IPC14_SPI2RXIP0_MASK                    0x00001000
#define _IPC14_SPI2RXIP0_LENGTH                  0x00000001

#define _IPC14_SPI2RXIP1_POSITION                0x0000000D
#define _IPC14_SPI2RXIP1_MASK                    0x00002000
#define _IPC14_SPI2RXIP1_LENGTH                  0x00000001

#define _IPC14_SPI2RXIP2_POSITION                0x0000000E
#define _IPC14_SPI2RXIP2_MASK                    0x00004000
#define _IPC14_SPI2RXIP2_LENGTH                  0x00000001

#define _IPC15_SPI3RXIP_POSITION                 0x00000000
#define _IPC15_SPI3RXIP_MASK                     0x00000007
#define _IPC15_SPI3RXIP_LENGTH                   0x00000003

#define _IPC15_DMA5IP_POSITION                   0x00000004
#define _IPC15_DMA5IP_MASK                       0x00000070
#define _IPC15_DMA5IP_LENGTH                     0x00000003

#define _IPC15_RTCIP_POSITION                    0x00000008
#define _IPC15_RTCIP_MASK                        0x00000700
#define _IPC15_RTCIP_LENGTH                      0x00000003

#define _IPC15_CCP1IP_POSITION                   0x0000000C
#define _IPC15_CCP1IP_MASK                       0x00007000
#define _IPC15_CCP1IP_LENGTH                     0x00000003

#define _IPC15_SPI3RXIP0_POSITION                0x00000000
#define _IPC15_SPI3RXIP0_MASK                    0x00000001
#define _IPC15_SPI3RXIP0_LENGTH                  0x00000001

#define _IPC15_SPI3RXIP1_POSITION                0x00000001
#define _IPC15_SPI3RXIP1_MASK                    0x00000002
#define _IPC15_SPI3RXIP1_LENGTH                  0x00000001

#define _IPC15_SPI3RXIP2_POSITION                0x00000002
#define _IPC15_SPI3RXIP2_MASK                    0x00000004
#define _IPC15_SPI3RXIP2_LENGTH                  0x00000001

#define _IPC15_DMA5IP0_POSITION                  0x00000004
#define _IPC15_DMA5IP0_MASK                      0x00000010
#define _IPC15_DMA5IP0_LENGTH                    0x00000001

#define _IPC15_DMA5IP1_POSITION                  0x00000005
#define _IPC15_DMA5IP1_MASK                      0x00000020
#define _IPC15_DMA5IP1_LENGTH                    0x00000001

#define _IPC15_DMA5IP2_POSITION                  0x00000006
#define _IPC15_DMA5IP2_MASK                      0x00000040
#define _IPC15_DMA5IP2_LENGTH                    0x00000001

#define _IPC15_RTCIP0_POSITION                   0x00000008
#define _IPC15_RTCIP0_MASK                       0x00000100
#define _IPC15_RTCIP0_LENGTH                     0x00000001

#define _IPC15_RTCIP1_POSITION                   0x00000009
#define _IPC15_RTCIP1_MASK                       0x00000200
#define _IPC15_RTCIP1_LENGTH                     0x00000001

#define _IPC15_RTCIP2_POSITION                   0x0000000A
#define _IPC15_RTCIP2_MASK                       0x00000400
#define _IPC15_RTCIP2_LENGTH                     0x00000001

#define _IPC15_CCP1IP0_POSITION                  0x0000000C
#define _IPC15_CCP1IP0_MASK                      0x00001000
#define _IPC15_CCP1IP0_LENGTH                    0x00000001

#define _IPC15_CCP1IP1_POSITION                  0x0000000D
#define _IPC15_CCP1IP1_MASK                      0x00002000
#define _IPC15_CCP1IP1_LENGTH                    0x00000001

#define _IPC15_CCP1IP2_POSITION                  0x0000000E
#define _IPC15_CCP1IP2_MASK                      0x00004000
#define _IPC15_CCP1IP2_LENGTH                    0x00000001

#define _IPC16_CCP2IP_POSITION                   0x00000000
#define _IPC16_CCP2IP_MASK                       0x00000007
#define _IPC16_CCP2IP_LENGTH                     0x00000003

#define _IPC16_U1ERIP_POSITION                   0x00000004
#define _IPC16_U1ERIP_MASK                       0x00000070
#define _IPC16_U1ERIP_LENGTH                     0x00000003

#define _IPC16_U2ERIP_POSITION                   0x00000008
#define _IPC16_U2ERIP_MASK                       0x00000700
#define _IPC16_U2ERIP_LENGTH                     0x00000003

#define _IPC16_CRCIP_POSITION                    0x0000000C
#define _IPC16_CRCIP_MASK                        0x00007000
#define _IPC16_CRCIP_LENGTH                      0x00000003

#define _IPC16_CCP2IP0_POSITION                  0x00000000
#define _IPC16_CCP2IP0_MASK                      0x00000001
#define _IPC16_CCP2IP0_LENGTH                    0x00000001

#define _IPC16_CCP2IP1_POSITION                  0x00000001
#define _IPC16_CCP2IP1_MASK                      0x00000002
#define _IPC16_CCP2IP1_LENGTH                    0x00000001

#define _IPC16_CCP2IP2_POSITION                  0x00000002
#define _IPC16_CCP2IP2_MASK                      0x00000004
#define _IPC16_CCP2IP2_LENGTH                    0x00000001

#define _IPC16_U1ERIP0_POSITION                  0x00000004
#define _IPC16_U1ERIP0_MASK                      0x00000010
#define _IPC16_U1ERIP0_LENGTH                    0x00000001

#define _IPC16_U1ERIP1_POSITION                  0x00000005
#define _IPC16_U1ERIP1_MASK                      0x00000020
#define _IPC16_U1ERIP1_LENGTH                    0x00000001

#define _IPC16_U1ERIP2_POSITION                  0x00000006
#define _IPC16_U1ERIP2_MASK                      0x00000040
#define _IPC16_U1ERIP2_LENGTH                    0x00000001

#define _IPC16_U2ERIP0_POSITION                  0x00000008
#define _IPC16_U2ERIP0_MASK                      0x00000100
#define _IPC16_U2ERIP0_LENGTH                    0x00000001

#define _IPC16_U2ERIP1_POSITION                  0x00000009
#define _IPC16_U2ERIP1_MASK                      0x00000200
#define _IPC16_U2ERIP1_LENGTH                    0x00000001

#define _IPC16_U2ERIP2_POSITION                  0x0000000A
#define _IPC16_U2ERIP2_MASK                      0x00000400
#define _IPC16_U2ERIP2_LENGTH                    0x00000001

#define _IPC16_CRCIP0_POSITION                   0x0000000C
#define _IPC16_CRCIP0_MASK                       0x00001000
#define _IPC16_CRCIP0_LENGTH                     0x00000001

#define _IPC16_CRCIP1_POSITION                   0x0000000D
#define _IPC16_CRCIP1_MASK                       0x00002000
#define _IPC16_CRCIP1_LENGTH                     0x00000001

