MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB406/mcu.h
#define _ODCE_ODCE0_POSITION                     0x00000000
#define _ODCE_ODCE0_MASK                         0x00000001
#define _ODCE_ODCE0_LENGTH                       0x00000001

#define _ODCE_ODCE1_POSITION                     0x00000001
#define _ODCE_ODCE1_MASK                         0x00000002
#define _ODCE_ODCE1_LENGTH                       0x00000001

#define _ODCE_ODCE2_POSITION                     0x00000002
#define _ODCE_ODCE2_MASK                         0x00000004
#define _ODCE_ODCE2_LENGTH                       0x00000001

#define _ODCE_ODCE3_POSITION                     0x00000003
#define _ODCE_ODCE3_MASK                         0x00000008
#define _ODCE_ODCE3_LENGTH                       0x00000001

#define _ODCE_ODCE4_POSITION                     0x00000004
#define _ODCE_ODCE4_MASK                         0x00000010
#define _ODCE_ODCE4_LENGTH                       0x00000001

#define _ODCE_ODCE5_POSITION                     0x00000005
#define _ODCE_ODCE5_MASK                         0x00000020
#define _ODCE_ODCE5_LENGTH                       0x00000001

#define _ODCE_ODCE6_POSITION                     0x00000006
#define _ODCE_ODCE6_MASK                         0x00000040
#define _ODCE_ODCE6_LENGTH                       0x00000001

#define _ODCE_ODCE7_POSITION                     0x00000007
#define _ODCE_ODCE7_MASK                         0x00000080
#define _ODCE_ODCE7_LENGTH                       0x00000001

#define _ANSE_ANSE0_POSITION                     0x00000000
#define _ANSE_ANSE0_MASK                         0x00000001
#define _ANSE_ANSE0_LENGTH                       0x00000001

#define _ANSE_ANSE1_POSITION                     0x00000001
#define _ANSE_ANSE1_MASK                         0x00000002
#define _ANSE_ANSE1_LENGTH                       0x00000001

#define _ANSE_ANSE2_POSITION                     0x00000002
#define _ANSE_ANSE2_MASK                         0x00000004
#define _ANSE_ANSE2_LENGTH                       0x00000001

#define _ANSE_ANSE3_POSITION                     0x00000003
#define _ANSE_ANSE3_MASK                         0x00000008
#define _ANSE_ANSE3_LENGTH                       0x00000001

#define _ANSE_ANSE4_POSITION                     0x00000004
#define _ANSE_ANSE4_MASK                         0x00000010
#define _ANSE_ANSE4_LENGTH                       0x00000001

#define _ANSE_ANSE5_POSITION                     0x00000005
#define _ANSE_ANSE5_MASK                         0x00000020
#define _ANSE_ANSE5_LENGTH                       0x00000001

#define _ANSE_ANSE6_POSITION                     0x00000006
#define _ANSE_ANSE6_MASK                         0x00000040
#define _ANSE_ANSE6_LENGTH                       0x00000001

#define _ANSE_ANSE7_POSITION                     0x00000007
#define _ANSE_ANSE7_MASK                         0x00000080
#define _ANSE_ANSE7_LENGTH                       0x00000001

#define _ANSE_ANSELE0_POSITION                   0x00000000
#define _ANSE_ANSELE0_MASK                       0x00000001
#define _ANSE_ANSELE0_LENGTH                     0x00000001

#define _ANSE_ANSELE1_POSITION                   0x00000001
#define _ANSE_ANSELE1_MASK                       0x00000002
#define _ANSE_ANSELE1_LENGTH                     0x00000001

#define _ANSE_ANSELE2_POSITION                   0x00000002
#define _ANSE_ANSELE2_MASK                       0x00000004
#define _ANSE_ANSELE2_LENGTH                     0x00000001

#define _ANSE_ANSELE3_POSITION                   0x00000003
#define _ANSE_ANSELE3_MASK                       0x00000008
#define _ANSE_ANSELE3_LENGTH                     0x00000001

#define _ANSE_ANSELE4_POSITION                   0x00000004
#define _ANSE_ANSELE4_MASK                       0x00000010
#define _ANSE_ANSELE4_LENGTH                     0x00000001

#define _ANSE_ANSELE5_POSITION                   0x00000005
#define _ANSE_ANSELE5_MASK                       0x00000020
#define _ANSE_ANSELE5_LENGTH                     0x00000001

#define _ANSE_ANSELE6_POSITION                   0x00000006
#define _ANSE_ANSELE6_MASK                       0x00000040
#define _ANSE_ANSELE6_LENGTH                     0x00000001

#define _ANSE_ANSELE7_POSITION                   0x00000007
#define _ANSE_ANSELE7_MASK                       0x00000080
#define _ANSE_ANSELE7_LENGTH                     0x00000001

#define _ANSELE_ANSE0_POSITION                   0x00000000
#define _ANSELE_ANSE0_MASK                       0x00000001
#define _ANSELE_ANSE0_LENGTH                     0x00000001

#define _ANSELE_ANSE1_POSITION                   0x00000001
#define _ANSELE_ANSE1_MASK                       0x00000002
#define _ANSELE_ANSE1_LENGTH                     0x00000001

#define _ANSELE_ANSE2_POSITION                   0x00000002
#define _ANSELE_ANSE2_MASK                       0x00000004
#define _ANSELE_ANSE2_LENGTH                     0x00000001

#define _ANSELE_ANSE3_POSITION                   0x00000003
#define _ANSELE_ANSE3_MASK                       0x00000008
#define _ANSELE_ANSE3_LENGTH                     0x00000001

#define _ANSELE_ANSE4_POSITION                   0x00000004
#define _ANSELE_ANSE4_MASK                       0x00000010
#define _ANSELE_ANSE4_LENGTH                     0x00000001

#define _ANSELE_ANSE5_POSITION                   0x00000005
#define _ANSELE_ANSE5_MASK                       0x00000020
#define _ANSELE_ANSE5_LENGTH                     0x00000001

#define _ANSELE_ANSE6_POSITION                   0x00000006
#define _ANSELE_ANSE6_MASK                       0x00000040
#define _ANSELE_ANSE6_LENGTH                     0x00000001

#define _ANSELE_ANSE7_POSITION                   0x00000007
#define _ANSELE_ANSE7_MASK                       0x00000080
#define _ANSELE_ANSE7_LENGTH                     0x00000001

#define _ANSELE_ANSELE0_POSITION                 0x00000000
#define _ANSELE_ANSELE0_MASK                     0x00000001
#define _ANSELE_ANSELE0_LENGTH                   0x00000001

#define _ANSELE_ANSELE1_POSITION                 0x00000001
#define _ANSELE_ANSELE1_MASK                     0x00000002
#define _ANSELE_ANSELE1_LENGTH                   0x00000001

