MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB406/mcu.h
#define _IOCPUE_CNPUE2_POSITION                  0x00000002
#define _IOCPUE_CNPUE2_MASK                      0x00000004
#define _IOCPUE_CNPUE2_LENGTH                    0x00000001

#define _IOCPUE_CNPUE3_POSITION                  0x00000003
#define _IOCPUE_CNPUE3_MASK                      0x00000008
#define _IOCPUE_CNPUE3_LENGTH                    0x00000001

#define _IOCPUE_CNPUE4_POSITION                  0x00000004
#define _IOCPUE_CNPUE4_MASK                      0x00000010
#define _IOCPUE_CNPUE4_LENGTH                    0x00000001

#define _IOCPUE_CNPUE5_POSITION                  0x00000005
#define _IOCPUE_CNPUE5_MASK                      0x00000020
#define _IOCPUE_CNPUE5_LENGTH                    0x00000001

#define _IOCPUE_CNPUE6_POSITION                  0x00000006
#define _IOCPUE_CNPUE6_MASK                      0x00000040
#define _IOCPUE_CNPUE6_LENGTH                    0x00000001

#define _IOCPUE_CNPUE7_POSITION                  0x00000007
#define _IOCPUE_CNPUE7_MASK                      0x00000080
#define _IOCPUE_CNPUE7_LENGTH                    0x00000001

#define _CNPDE_IOCPDE0_POSITION                  0x00000000
#define _CNPDE_IOCPDE0_MASK                      0x00000001
#define _CNPDE_IOCPDE0_LENGTH                    0x00000001

#define _CNPDE_IOCPDE1_POSITION                  0x00000001
#define _CNPDE_IOCPDE1_MASK                      0x00000002
#define _CNPDE_IOCPDE1_LENGTH                    0x00000001

#define _CNPDE_IOCPDE2_POSITION                  0x00000002
#define _CNPDE_IOCPDE2_MASK                      0x00000004
#define _CNPDE_IOCPDE2_LENGTH                    0x00000001

#define _CNPDE_IOCPDE3_POSITION                  0x00000003
#define _CNPDE_IOCPDE3_MASK                      0x00000008
#define _CNPDE_IOCPDE3_LENGTH                    0x00000001

#define _CNPDE_IOCPDE4_POSITION                  0x00000004
#define _CNPDE_IOCPDE4_MASK                      0x00000010
#define _CNPDE_IOCPDE4_LENGTH                    0x00000001

#define _CNPDE_IOCPDE5_POSITION                  0x00000005
#define _CNPDE_IOCPDE5_MASK                      0x00000020
#define _CNPDE_IOCPDE5_LENGTH                    0x00000001

#define _CNPDE_IOCPDE6_POSITION                  0x00000006
#define _CNPDE_IOCPDE6_MASK                      0x00000040
#define _CNPDE_IOCPDE6_LENGTH                    0x00000001

#define _CNPDE_IOCPDE7_POSITION                  0x00000007
#define _CNPDE_IOCPDE7_MASK                      0x00000080
#define _CNPDE_IOCPDE7_LENGTH                    0x00000001

#define _CNPDE_CNPDE0_POSITION                   0x00000000
#define _CNPDE_CNPDE0_MASK                       0x00000001
#define _CNPDE_CNPDE0_LENGTH                     0x00000001

#define _CNPDE_CNPDE1_POSITION                   0x00000001
#define _CNPDE_CNPDE1_MASK                       0x00000002
#define _CNPDE_CNPDE1_LENGTH                     0x00000001

#define _CNPDE_CNPDE2_POSITION                   0x00000002
#define _CNPDE_CNPDE2_MASK                       0x00000004
#define _CNPDE_CNPDE2_LENGTH                     0x00000001

#define _CNPDE_CNPDE3_POSITION                   0x00000003
#define _CNPDE_CNPDE3_MASK                       0x00000008
#define _CNPDE_CNPDE3_LENGTH                     0x00000001

#define _CNPDE_CNPDE4_POSITION                   0x00000004
#define _CNPDE_CNPDE4_MASK                       0x00000010
#define _CNPDE_CNPDE4_LENGTH                     0x00000001

#define _CNPDE_CNPDE5_POSITION                   0x00000005
#define _CNPDE_CNPDE5_MASK                       0x00000020
#define _CNPDE_CNPDE5_LENGTH                     0x00000001

#define _CNPDE_CNPDE6_POSITION                   0x00000006
#define _CNPDE_CNPDE6_MASK                       0x00000040
#define _CNPDE_CNPDE6_LENGTH                     0x00000001

#define _CNPDE_CNPDE7_POSITION                   0x00000007
#define _CNPDE_CNPDE7_MASK                       0x00000080
#define _CNPDE_CNPDE7_LENGTH                     0x00000001

#define _IOCPDE_IOCPDE0_POSITION                 0x00000000
#define _IOCPDE_IOCPDE0_MASK                     0x00000001
#define _IOCPDE_IOCPDE0_LENGTH                   0x00000001

#define _IOCPDE_IOCPDE1_POSITION                 0x00000001
#define _IOCPDE_IOCPDE1_MASK                     0x00000002
#define _IOCPDE_IOCPDE1_LENGTH                   0x00000001

#define _IOCPDE_IOCPDE2_POSITION                 0x00000002
#define _IOCPDE_IOCPDE2_MASK                     0x00000004
#define _IOCPDE_IOCPDE2_LENGTH                   0x00000001

#define _IOCPDE_IOCPDE3_POSITION                 0x00000003
#define _IOCPDE_IOCPDE3_MASK                     0x00000008
#define _IOCPDE_IOCPDE3_LENGTH                   0x00000001

#define _IOCPDE_IOCPDE4_POSITION                 0x00000004
#define _IOCPDE_IOCPDE4_MASK                     0x00000010
#define _IOCPDE_IOCPDE4_LENGTH                   0x00000001

#define _IOCPDE_IOCPDE5_POSITION                 0x00000005
#define _IOCPDE_IOCPDE5_MASK                     0x00000020
#define _IOCPDE_IOCPDE5_LENGTH                   0x00000001

#define _IOCPDE_IOCPDE6_POSITION                 0x00000006
#define _IOCPDE_IOCPDE6_MASK                     0x00000040
#define _IOCPDE_IOCPDE6_LENGTH                   0x00000001

#define _IOCPDE_IOCPDE7_POSITION                 0x00000007
#define _IOCPDE_IOCPDE7_MASK                     0x00000080
#define _IOCPDE_IOCPDE7_LENGTH                   0x00000001

#define _IOCPDE_CNPDE0_POSITION                  0x00000000
#define _IOCPDE_CNPDE0_MASK                      0x00000001
#define _IOCPDE_CNPDE0_LENGTH                    0x00000001

#define _IOCPDE_CNPDE1_POSITION                  0x00000001
#define _IOCPDE_CNPDE1_MASK                      0x00000002
#define _IOCPDE_CNPDE1_LENGTH                    0x00000001

#define _IOCPDE_CNPDE2_POSITION                  0x00000002
#define _IOCPDE_CNPDE2_MASK                      0x00000004
#define _IOCPDE_CNPDE2_LENGTH                    0x00000001

#define _IOCPDE_CNPDE3_POSITION                  0x00000003
#define _IOCPDE_CNPDE3_MASK                      0x00000008
#define _IOCPDE_CNPDE3_LENGTH                    0x00000001

#define _IOCPDE_CNPDE4_POSITION                  0x00000004
#define _IOCPDE_CNPDE4_MASK                      0x00000010
#define _IOCPDE_CNPDE4_LENGTH                    0x00000001

#define _IOCPDE_CNPDE5_POSITION                  0x00000005
#define _IOCPDE_CNPDE5_MASK                      0x00000020
#define _IOCPDE_CNPDE5_LENGTH                    0x00000001

