MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB406/mcu.h
#define _CNPUH_IOCPUH2_POSITION                  0x00000002
#define _CNPUH_IOCPUH2_MASK                      0x00000004
#define _CNPUH_IOCPUH2_LENGTH                    0x00000001

#define _CNPUH_IOCPUH3_POSITION                  0x00000003
#define _CNPUH_IOCPUH3_MASK                      0x00000008
#define _CNPUH_IOCPUH3_LENGTH                    0x00000001

#define _CNPUH_IOCPUH4_POSITION                  0x00000004
#define _CNPUH_IOCPUH4_MASK                      0x00000010
#define _CNPUH_IOCPUH4_LENGTH                    0x00000001

#define _CNPUH_IOCPUH5_POSITION                  0x00000005
#define _CNPUH_IOCPUH5_MASK                      0x00000020
#define _CNPUH_IOCPUH5_LENGTH                    0x00000001

#define _CNPUH_IOCPUH6_POSITION                  0x00000006
#define _CNPUH_IOCPUH6_MASK                      0x00000040
#define _CNPUH_IOCPUH6_LENGTH                    0x00000001

#define _CNPUH_IOCPUH7_POSITION                  0x00000007
#define _CNPUH_IOCPUH7_MASK                      0x00000080
#define _CNPUH_IOCPUH7_LENGTH                    0x00000001

#define _CNPUH_IOCPUH8_POSITION                  0x00000008
#define _CNPUH_IOCPUH8_MASK                      0x00000100
#define _CNPUH_IOCPUH8_LENGTH                    0x00000001

#define _CNPUH_IOCPUH9_POSITION                  0x00000009
#define _CNPUH_IOCPUH9_MASK                      0x00000200
#define _CNPUH_IOCPUH9_LENGTH                    0x00000001

#define _CNPUH_IOCPUH10_POSITION                 0x0000000A
#define _CNPUH_IOCPUH10_MASK                     0x00000400
#define _CNPUH_IOCPUH10_LENGTH                   0x00000001

#define _CNPUH_IOCPUH11_POSITION                 0x0000000B
#define _CNPUH_IOCPUH11_MASK                     0x00000800
#define _CNPUH_IOCPUH11_LENGTH                   0x00000001

#define _CNPUH_IOCPUH12_POSITION                 0x0000000C
#define _CNPUH_IOCPUH12_MASK                     0x00001000
#define _CNPUH_IOCPUH12_LENGTH                   0x00000001

#define _CNPUH_IOCPUH13_POSITION                 0x0000000D
#define _CNPUH_IOCPUH13_MASK                     0x00002000
#define _CNPUH_IOCPUH13_LENGTH                   0x00000001

#define _CNPUH_IOCPUH14_POSITION                 0x0000000E
#define _CNPUH_IOCPUH14_MASK                     0x00004000
#define _CNPUH_IOCPUH14_LENGTH                   0x00000001

#define _CNPUH_IOCPUH15_POSITION                 0x0000000F
#define _CNPUH_IOCPUH15_MASK                     0x00008000
#define _CNPUH_IOCPUH15_LENGTH                   0x00000001

#define _CNPUH_CNPUH0_POSITION                   0x00000000
#define _CNPUH_CNPUH0_MASK                       0x00000001
#define _CNPUH_CNPUH0_LENGTH                     0x00000001

#define _CNPUH_CNPUH1_POSITION                   0x00000001
#define _CNPUH_CNPUH1_MASK                       0x00000002
#define _CNPUH_CNPUH1_LENGTH                     0x00000001

#define _CNPUH_CNPUH2_POSITION                   0x00000002
#define _CNPUH_CNPUH2_MASK                       0x00000004
#define _CNPUH_CNPUH2_LENGTH                     0x00000001

#define _CNPUH_CNPUH3_POSITION                   0x00000003
#define _CNPUH_CNPUH3_MASK                       0x00000008
#define _CNPUH_CNPUH3_LENGTH                     0x00000001

#define _CNPUH_CNPUH4_POSITION                   0x00000004
#define _CNPUH_CNPUH4_MASK                       0x00000010
#define _CNPUH_CNPUH4_LENGTH                     0x00000001

#define _CNPUH_CNPUH5_POSITION                   0x00000005
#define _CNPUH_CNPUH5_MASK                       0x00000020
#define _CNPUH_CNPUH5_LENGTH                     0x00000001

#define _CNPUH_CNPUH6_POSITION                   0x00000006
#define _CNPUH_CNPUH6_MASK                       0x00000040
#define _CNPUH_CNPUH6_LENGTH                     0x00000001

#define _CNPUH_CNPUH7_POSITION                   0x00000007
#define _CNPUH_CNPUH7_MASK                       0x00000080
#define _CNPUH_CNPUH7_LENGTH                     0x00000001

#define _CNPUH_CNPUH8_POSITION                   0x00000008
#define _CNPUH_CNPUH8_MASK                       0x00000100
#define _CNPUH_CNPUH8_LENGTH                     0x00000001

#define _CNPUH_CNPUH9_POSITION                   0x00000009
#define _CNPUH_CNPUH9_MASK                       0x00000200
#define _CNPUH_CNPUH9_LENGTH                     0x00000001

#define _CNPUH_CNPUH10_POSITION                  0x0000000A
#define _CNPUH_CNPUH10_MASK                      0x00000400
#define _CNPUH_CNPUH10_LENGTH                    0x00000001

#define _CNPUH_CNPUH11_POSITION                  0x0000000B
#define _CNPUH_CNPUH11_MASK                      0x00000800
#define _CNPUH_CNPUH11_LENGTH                    0x00000001

#define _CNPUH_CNPUH12_POSITION                  0x0000000C
#define _CNPUH_CNPUH12_MASK                      0x00001000
#define _CNPUH_CNPUH12_LENGTH                    0x00000001

#define _CNPUH_CNPUH13_POSITION                  0x0000000D
#define _CNPUH_CNPUH13_MASK                      0x00002000
#define _CNPUH_CNPUH13_LENGTH                    0x00000001

#define _CNPUH_CNPUH14_POSITION                  0x0000000E
#define _CNPUH_CNPUH14_MASK                      0x00004000
#define _CNPUH_CNPUH14_LENGTH                    0x00000001

#define _CNPUH_CNPUH15_POSITION                  0x0000000F
#define _CNPUH_CNPUH15_MASK                      0x00008000
#define _CNPUH_CNPUH15_LENGTH                    0x00000001

#define _IOCPUH_IOCPH0_POSITION                  0x00000000
#define _IOCPUH_IOCPH0_MASK                      0x00000001
#define _IOCPUH_IOCPH0_LENGTH                    0x00000001

#define _IOCPUH_IOCPH1_POSITION                  0x00000001
#define _IOCPUH_IOCPH1_MASK                      0x00000002
#define _IOCPUH_IOCPH1_LENGTH                    0x00000001

#define _IOCPUH_IOCPH2_POSITION                  0x00000002
#define _IOCPUH_IOCPH2_MASK                      0x00000004
#define _IOCPUH_IOCPH2_LENGTH                    0x00000001

#define _IOCPUH_IOCPH3_POSITION                  0x00000003
#define _IOCPUH_IOCPH3_MASK                      0x00000008
#define _IOCPUH_IOCPH3_LENGTH                    0x00000001

#define _IOCPUH_IOCPH4_POSITION                  0x00000004
#define _IOCPUH_IOCPH4_MASK                      0x00000010
#define _IOCPUH_IOCPH4_LENGTH                    0x00000001

#define _IOCPUH_IOCPH5_POSITION                  0x00000005
#define _IOCPUH_IOCPH5_MASK                      0x00000020
#define _IOCPUH_IOCPH5_LENGTH                    0x00000001

