MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB406/mcu.h
/*
** Only one invocation of FDS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDS.
** Multiple options may be combined, as shown:
**
** _FDS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Deep Sleep Watchdog Timer Postscale Select bits:
**     DSWDTPS_DSWDTPS00    1:32 (1 ms)
**     DSWDTPS_DSWDTPS01    1:64 (2.1 ms)
**     DSWDTPS_DSWDTPS02    1:128 (4.1 ms)
**     DSWDTPS_DSWDTPS03    1:256 (8.3 ms)
**     DSWDTPS_DSWDTPS04    1:512 (16.5 ms)
**     DSWDTPS_DSWDTPS05    1:1,024 (33 ms)
**     DSWDTPS_DSWDTPS06    1:2,048 (66.1 ms)
**     DSWDTPS_DSWDTPS07    1:4,096 (132.1 ms)
**     DSWDTPS_DSWDTPS08    1:8,192 (264.3 ms)
**     DSWDTPS_DSWDTPS09    1:16,384 (528.5 ms)
**     DSWDTPS_DSWDTPS0A    1:32,768 (1.057s)
**     DSWDTPS_DSWDTPS0B    1:65,536 (2.114s)
**     DSWDTPS_DSWDTPS0C    1:131,072 (4.228s)
**     DSWDTPS_DSWDTPS0D    1:262,114 (8.456s)
**     DSWDTPS_DSWDTPS0E    1:524,288 (16.912s)
**     DSWDTPS_DSWDTPS0F    1:1,048,576 (33.825s)
**     DSWDTPS_DSWDTPS10    1:2,097,152 (67.7s)
**     DSWDTPS_DSWDTPS11    1:4,194,304 (135.3s)
**     DSWDTPS_DSWDTPS12    1:8,388,608 (4.5 minutes)
**     DSWDTPS_DSWDTPS13    1:16,777,216 (9.0 minutes)
**     DSWDTPS_DSWDTPS14    1:33,554,432 (18.0 minutes)
**     DSWDTPS_DSWDTPS15    1:67,108,864 (36.1 minutes)
**     DSWDTPS_DSWDTPS16    1:134,217,728 (72.2 minutes)
**     DSWDTPS_DSWDTPS17    1:268,435,456 (2.4 hours)
**     DSWDTPS_DSWDTPS18    1:536,870,912 (4.8 hours)
**     DSWDTPS_DSWDTPS19    1:1,073,741,824 (9.6 hours)
**     DSWDTPS_DSWDTPS1A    1:2,147,483,648 (19.2 hours)
**     DSWDTPS_DSWDTPS1B    1:4,294,967,296 (38.5 hours)
**     DSWDTPS_DSWDTPS1C    1:8,589,934592 (77.0 hours)
**     DSWDTPS_DSWDTPS1D    1:17,179,869,184 (6.4 days)
**     DSWDTPS_DSWDTPS1E    1:34,359,738,368(12.8 days)
**     DSWDTPS_DSWDTPS1F    1:68,719,476,736 (25.7 days)
**
**   DSWDT Reference Clock Select bit:
**     DSWDTOSC_SOSC        DSWDT uses Secondary Oscillator (SOSC)
**     DSWDTOSC_LPRC        DSWDT uses Low Power RC Oscillator (LPRC)
**
**   Deep Sleep Zero-Power BOR Enable bit:
**     DSBOREN_OFF          Deep Sleep BOR disabled in Deep Sleep
**     DSBOREN_ON           Deep Sleep BOR enabled in Deep Sleep
**
**   Deep Sleep Watchdog Timer Enable bit:
**     DSWDTEN_OFF          DSWDT disabled
**     DSWDTEN_ON           DSWDT enabled
**
**   Deep Sleep Software Control Select Bit:
**     DSSWEN_OFF           Deep Sleep disabled
**     DSSWEN_ON            Deep Sleep enabled and controlled by the DSEN bit
**
*/

#define DSWDTPS_DSWDTPS00    0x80E0
#define DSWDTPS_DSWDTPS01    0x80E1
#define DSWDTPS_DSWDTPS02    0x80E2
#define DSWDTPS_DSWDTPS03    0x80E3
#define DSWDTPS_DSWDTPS04    0x80E4
#define DSWDTPS_DSWDTPS05    0x80E5
#define DSWDTPS_DSWDTPS06    0x80E6
#define DSWDTPS_DSWDTPS07    0x80E7
#define DSWDTPS_DSWDTPS08    0x80E8
#define DSWDTPS_DSWDTPS09    0x80E9
#define DSWDTPS_DSWDTPS0A    0x80EA
#define DSWDTPS_DSWDTPS0B    0x80EB
#define DSWDTPS_DSWDTPS0C    0x80EC
#define DSWDTPS_DSWDTPS0D    0x80ED
#define DSWDTPS_DSWDTPS0E    0x80EE
#define DSWDTPS_DSWDTPS0F    0x80EF
#define DSWDTPS_DSWDTPS10    0x80F0
#define DSWDTPS_DSWDTPS11    0x80F1
#define DSWDTPS_DSWDTPS12    0x80F2
#define DSWDTPS_DSWDTPS13    0x80F3
#define DSWDTPS_DSWDTPS14    0x80F4
#define DSWDTPS_DSWDTPS15    0x80F5
#define DSWDTPS_DSWDTPS16    0x80F6
#define DSWDTPS_DSWDTPS17    0x80F7
#define DSWDTPS_DSWDTPS18    0x80F8
#define DSWDTPS_DSWDTPS19    0x80F9
#define DSWDTPS_DSWDTPS1A    0x80FA
#define DSWDTPS_DSWDTPS1B    0x80FB
#define DSWDTPS_DSWDTPS1C    0x80FC
#define DSWDTPS_DSWDTPS1D    0x80FD
#define DSWDTPS_DSWDTPS1E    0x80FE
#define DSWDTPS_DSWDTPS1F    0x80FF

#define DSWDTOSC_SOSC        0x80DF
#define DSWDTOSC_LPRC        0x80FF

#define DSBOREN_OFF          0x80BF
#define DSBOREN_ON           0x80FF

#define DSWDTEN_OFF          0x807F
#define DSWDTEN_ON           0x80FF

#define DSSWEN_OFF           0x00FF
#define DSSWEN_ON            0x80FF

/* Register FDEVOPT1 (0x57b0)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDEVOPT1;
#define _FDEVOPT1(x) __attribute__((address(0x57b0),deprecated_definition("consider migrating to #pragma config"),section("__FDEVOPT1.sec"),space(prog))) __prog__ uint16_t _FDEVOPT1 = (x);

/*
** Only one invocation of FDEVOPT1 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDEVOPT1.
** Multiple options may be combined, as shown:
**
** _FDEVOPT1( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Alternate Comparator Input Enable bit:
**     ALTCMPI_ENABLE       C1INC, C2INC and C3INC are on RG9
**     ALTCMPI_DISABLE      C1INC, C2INC, and C3INC are on their standard pin locations
**
**   Tamper Pin Enable bit:
**     TMPRPIN_ON           TMPRN pin function is enabled
**     TMPRPIN_OFF          TMPRN pin function is disabled
**
**   RAM Based Entryption Key Wipe Enable bit:
**     TMPRWIPE_ON          
**     TMPRWIPE_OFF         
**
**   Alternate VREF location Enable:
**     ALTVREF_ALTVREFEN    VREF is on an alternate pin (VREF+ on RB0 and VREF- on RB1)
**     ALTVREF_ALTVREFDIS   VREF is on a default pin (VREF+ on RA10 and VREF- on RA9)
**
*/

#define ALTCMPI_ENABLE       0x001C
#define ALTCMPI_DISABLE      0x001E

#define TMPRPIN_ON           0x001A
#define TMPRPIN_OFF          0x001E

#define TMPRWIPE_ON          0x0016
#define TMPRWIPE_OFF         0x001E

#define ALTVREF_ALTVREFEN    0x000E
#define ALTVREF_ALTVREFDIS   0x001E

/* Register FBTSEQ (0x57fc)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBTSEQ;
#define _FBTSEQ(x) __attribute__((address(0x57fc),deprecated_definition("consider migrating to #pragma config"),section("__FBTSEQ.sec"),space(prog))) __prog__ uint16_t _FBTSEQ = (x);

/*
** Only one invocation of FBTSEQ should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBTSEQ.
** Multiple options may be combined, as shown:
**
** _FBTSEQ( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Relative value defining which partition will be active after devie Reset; the partition containing a lower boot number will be active.:
**     BSEQ_BSEQ            Boot Sequence Number bits
**
**   The one's complement of BSEQ; must be calculated by the user and written during device programming.:
**     IBSEQ_IBSEQ          Inverse Boot Sequence Number bits
**
*/

#define BSEQ_BSEQ            0xF000

#define IBSEQ_IBSEQ          0xFF0FFF

#endif



